# Install git in its current version.
brew "git", link: true

# Install helix (https://helix-editor.com).
tap "helix-editor/helix"
brew "helix", link: true

# Install flyctl (https://github.com/superfly/flyctl).
tap "superfly/tap"
brew "flyctl", link: true

# Install mosh.
brew "mosh", link: true

# Install ImageMagick.
brew "imagemagick@6" # v6
brew "imagemagick"   # v7

# Install miniconda.
brew "miniconda", link: true

# Install watch
brew "watch", link: true

# Install mcfly (https://github.com/cantino/mcfly).
brew "mcfly"", link: true

# Install difftastic (https://difftastic.wilfred.me.uk).
brew "difftastic", link: true

# Install mise (https://github.com/jdx/mise) and "Usage CLI" (https://usage.jdx.dev/cli/).
brew "mise", link: true
brew "jdx/tap/usage", link: true

# Install lnav (https://lnav.org)
brew "lnav", link: true

# Install ncdu (https://dev.yorhel.nl/ncdu)
brew "ncdu", link: true

# Install btop (https://github.com/aristocratos/btop)
brew "btop", link: true

# Install lazygit (https://github.com/jesseduffield/lazygit)
brew "lazygit", link: true

# Install act (https://github.com/nektos/act)
brew "act", link: true
